etn-electrical/JIVE_Client_Code/Babelfish/Code/MiscCode/FUS/Images_Ctrls/Esp32_Image_Ctrl.cpp
/**
 *****************************************************************************************
 * @file Esp32_Image_Ctrl.cpp
 * @details See header file for module overview.
 * @copyright 2021 Eaton Corporation. All Rights Reserved.
 *
 *****************************************************************************************
 */
#include "includes.h"
#include "Esp32_Image_Ctrl.h"
#include "Babelfish_Assert.h"

namespace BF_FUS
{
/*
 *****************************************************************************************
 *		Constants
 *****************************************************************************************
 */
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
Esp32_Image_Ctrl::Esp32_Image_Ctrl( NV_Ctrl* scratch_nv_ctrl, NV_Ctrl* real_nv_ctrl,
									img_config_t* image_config, Commit_Ctrl* commit_ctrl )
	: Image_Header(),
	m_scratch_nv_ctrl( scratch_nv_ctrl ),
	m_image_config( image_config ),
	m_commit_ctrl( commit_ctrl ),
	m_new_image_ver( 0U ),
	m_init_crc( 0U ),
	m_new_prod_code( 0U ),
	m_is_scratch_erased( false ),
	m_esp_header_size( 0U )
{
	memset( &m_image, 0, sizeof( m_image ) );
	m_image.untrusted_nv_ctrl = real_nv_ctrl;
	m_image.trusted_nv_ctrl = real_nv_ctrl;
	#ifdef OVERRIDE_FUS_TIME
	m_set_validate_time = VALIDATE_WAIT_TIME_MS;
	m_set_commit_time = 0U;
	#endif	// OVERRIDE_FUS_TIME

	if ( LOCAL_COMP_APP_IMG_GUID == m_image_config->guid )
	{
		/*
		 * Offset for PXGreen header is = 24+ 8 + 256 = 288.
		 * sizeof(esp_image_header_t) + sizeof(esp_image_segment_header_t) + sizeof(esp_app_desc_t)
		 * This offset should be used only for APP IMAGE, For WEB and REST Image it should be 0U.
		 */
		m_esp_header_size = sizeof( esp_image_header_t ) + sizeof( esp_image_segment_header_t ) +
			sizeof( esp_app_desc_t );
	}

	new CR_Tasker( &Image_Upgrade_Task_Static, reinterpret_cast<CR_TASKER_PARAM>( this ),
				   CR_TASKER_IDLE_PRIORITY, "Image Upgrade Task" );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
fus_op_status_t Esp32_Image_Ctrl::Get_Image_Specs( image_info_resp_t* image_resp )
{
	image_resp->name = m_image_config->name;
	image_resp->name_len = m_image_config->name_len;
	image_resp->guid = m_image_config->guid;
	image_resp->version = m_image_config->version;
	Image_Header::Get_Compatibility_Num( &image_resp->compatibility_num );
	return ( FUS_NO_ERROR );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
fus_op_status_t Esp32_Image_Ctrl::Status( image_status_resp_t* status_resp )
{
	fus_op_status_t return_status = FUS_NO_ERROR;

	if ( m_image.status == FUS_COMMIT_DONE )
	{
		return_status = FUS_NO_ERROR;
		status_resp->remaining_op_time = DEFAULT_FUS_WAIT_TIME_MS;
	}
	else if ( m_image.status == FUS_PENDING_CALL_BACK )
	{
		return_status = FUS_PENDING_CALL_BACK;
		uint32_t time = BF_Lib::Timers::Time_Passed( m_image.start_time );
		if ( time < m_image.wait_time )
		{
			status_resp->remaining_op_time = ( m_image.wait_time - time );
		}
		else
		{
			status_resp->remaining_op_time = DEFAULT_FUS_WAIT_TIME_MS;
		}
	}
	else if ( m_image.status == FUS_PREVIOUS_CMD_ERROR )
	{
		return_status = FUS_PREVIOUS_CMD_ERROR;
		status_resp->remaining_op_time = DEFAULT_IDLE_TIME_MS;
	}
	else
	{
		status_resp->remaining_op_time = DEFAULT_IDLE_TIME_MS;
	}
	status_resp->status = m_image.status;
	return ( return_status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */

fus_op_status_t Esp32_Image_Ctrl::Write( image_write_req_t* write_req,
										 image_write_resp_t* write_resp )
{
	m_image.status = FUS_NO_ERROR;
	if ( m_is_scratch_erased == false )
	{
		if ( m_scratch_nv_ctrl != nullptr )
		{
			m_image.untrusted_nv_ctrl = m_scratch_nv_ctrl;
		}
		else
		{
			m_image.status = FUS_MEMORY_ACCESS_VIOLATION_ERROR;
		}
	}

	NV_Ctrl::mem_range_info_t untrusted_mem_range_info = { };
	NV_Ctrl::mem_range_info_t trusted_mem_range_info = { };

	m_image.untrusted_nv_ctrl->Get_Memory_Info( &untrusted_mem_range_info );
	m_image.trusted_nv_ctrl->Get_Memory_Info( &trusted_mem_range_info );
	m_image.status = Check_Range( write_req->address, write_req->data_len, &trusted_mem_range_info );

	if ( m_image.status == FUS_NO_ERROR )
	{
		if ( m_image.state == IDLE )
		{
			uint32_t offset = write_req->address - trusted_mem_range_info.start_address;
			m_image.address = untrusted_mem_range_info.start_address + offset;
			m_image.length = write_req->data_len;

			if ( true == New_Request( m_image.address, m_image.length ) )
			{
				m_image.data = g_fus_op_buf;	/* m_length is validated against MAX_CHUNK_LENGTH defined in user
												   space(ToDo) */
				if ( m_image.data != nullptr )
				{
					BF_Lib::Copy_Data( m_image.data, m_image.length, write_req->data, write_req->data_len );
					/*
					   LTK-8543 -
					   In STM32F767 controller, due to cache memory implementation WebUI code pack image on external
					      flash failes to download. Operation failes during the validation stage.
					   To resovlve this issue we need to clean and invalidate the cache memory before write operation,
					      so that controller will copy data from actual memory rather than cache memory during write
					      operation.
					 */
#if defined( DATA_CACHE_ENABLE )
					SCB_CleanInvalidateDCache_by_Addr( reinterpret_cast<uint32_t*>( g_fus_op_buf ), MAX_CHUNK_SIZE );
#endif	// DATA_CACHE_ENABLE

