etn-electrical/JIVE_Client_Code/Babelfish/Code/MiscCode/FUS/Images_Ctrls/Esp32_Image_Ctrl.cpp
#if defined ( INSTRUCTION_CACHE_ENABLE )
					SCB_InvalidateICache();
#endif	// INSTRUCTION_CACHE_ENABLE
					if ( m_is_scratch_erased == false )
					{
						NV_Ctrl::nv_status_t nv_status = m_image.untrusted_nv_ctrl->Erase_All(
							Esp32_Image_Ctrl::Image_Status_Cb_Static, this );
						if ( NV_Ctrl::PENDING_CALL_BACK == nv_status )
						{
							m_image.wait_time =
								m_image.untrusted_nv_ctrl->Erase_Time( untrusted_mem_range_info.start_address,
																	   ( untrusted_mem_range_info.end_address -
																		 untrusted_mem_range_info.start_address ) );
							m_image.wait_time += m_image.untrusted_nv_ctrl->Write_Time( m_image.data,
																						untrusted_mem_range_info.start_address, m_image.length,
																						false );
							m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
							m_image.state_prev = ERASE;
							m_image.state = WAIT;	/* Image will be in WAIT state for infinite time ToDo */
							m_image.status = FUS_PENDING_CALL_BACK;
						}
						else if ( NV_Ctrl::BUSY_ERROR == nv_status )
						{
							m_image.wait_time = BUSY_ERROR_WAIT_TIME_MS;
							m_image.retry_timeout = RETRY_TIME_MS + BF_Lib::Timers::Get_Time();
							m_image.state_prev = ERASE;
							m_image.state = RETRY;	// Alert: Update m_retry_timeout before going into RETRY state
							m_image.retry_count = 0U;	// Clear retry count
						}
						else
						{
							// ToDo
						}
					}
					else
					{
						NV_Ctrl::nv_status_t status =
							m_image.untrusted_nv_ctrl->Write( ( const_cast<uint8_t*>( m_image.data ) ),
															  m_image.address, m_image.length,
															  Esp32_Image_Ctrl::Image_Status_Cb_Static,
															  this );
						if ( NV_Ctrl::PENDING_CALL_BACK == status )
						{
							m_image.wait_time = m_image.untrusted_nv_ctrl->Write_Time( m_image.data, m_image.address,
																					   m_image.length,
																					   false );
							m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
							m_image.state_prev = WRITE;
							m_image.state = WAIT;	/* Image will be in WAIT state for infinite time ToDo */
							m_image.status = FUS_PENDING_CALL_BACK;
							m_image.start_time = BF_Lib::Timers::Get_Time();
						}
						else if ( NV_Ctrl::BUSY_ERROR == status )
						{
							m_image.wait_time = BUSY_ERROR_WAIT_TIME_MS;
							m_image.retry_timeout = RETRY_TIME_MS + BF_Lib::Timers::Get_Time();
							m_image.state_prev = WRITE;
							m_image.state = RETRY;	// Alert: Update m_retry_timeout before going into RETRY state
							m_image.retry_count = 0U;	// Clear retry count
						}
						else
						{
							// ToDo
						}
					}
				}
				else
				{
					FUS_DEBUG_PRINT( DBG_MSG_ERROR, " Heap memory not available " );
					// ToDo: Heap not available
					BF_ASSERT( false );
				}
			}
			else
			{
				/* Invalid request */
				m_image.wait_time = DEFAULT_IDLE_TIME_MS;
				m_image.status = FUS_BAD_ADDRESS_ERROR;
				FUS_DEBUG_PRINT( DBG_MSG_ERROR, "Selected address invalid" );
			}
		}
		else
		{
			if ( m_image.state == ERROR )
			{
				m_image.wait_time = DEFAULT_IDLE_TIME_MS;
				m_image.status = FUS_PROCESSOR_NOT_READY_ERROR;
				FUS_DEBUG_PRINT( DBG_MSG_ERROR, "Processor not ready " );
			}
			else
			{
				m_image.wait_time = m_image.untrusted_nv_ctrl->Get_Wait_Time();
				m_image.status = FUS_ACCESS_TIME_PENDING;
			}

		}

	}
	else
	{
		// REQUEST_INVALID due to FUS_BAD_ADDRESS_ERROR or FUS_BAD_DATA_LENGTH_ERROR
		m_image.wait_time = DEFAULT_IDLE_TIME_MS;
	}
	write_resp->op_time = m_image.wait_time;
	write_resp->response_code = m_image.status;
	return ( m_image.status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
fus_op_status_t Esp32_Image_Ctrl::Validate( image_validate_req_t* validate_req, image_validate_resp_t* validate_resp )
{
	if ( m_image.status == FUS_VALID_IMAGE )
	{
		validate_resp->op_time = 0U;
		validate_resp->status = m_image.status;
		m_image.state_prev = IDLE;
		m_image.state = RESET;
		m_image.sub_state = COMMON_IDLE;
	}
	else if ( ( m_image.status == FUS_INVALID_IMAGE_CHECKSUM_FAILED ) || \
			  ( m_image.status == FUS_INVALID_IMAGE_SIGNATURE_FAILED ) || \
			  ( m_image.status == FUS_INVALID_IMAGE_PRODUCT_CODE_FAILED ) || \
			  ( m_image.status == FUS_INVALID_IMAGE_VERSION_ROLLBACK_FAILED ) )
	{
		validate_resp->op_time = 0U;
		m_image.state_prev = IDLE;
		m_image.state = RESET;
		m_image.sub_state = COMMON_IDLE;
		validate_resp->status = m_image.status;
	}
	else if ( m_image.status == FUS_PENDING_CALL_BACK )
	{
	#ifdef OVERRIDE_FUS_TIME
		m_image.wait_time = m_commit_ctrl->Add_Buffer_Time( m_set_validate_time );
	#else
		m_image.wait_time = m_commit_ctrl->Add_Buffer_Time( VALIDATE_WAIT_TIME_MS );
	#endif	// OVERRIDE_FUS_TIME
		validate_resp->op_time = m_image.wait_time;
		validate_resp->status = FUS_VALIDATION_IN_PROGRESS;
	}
	else
	{
		m_image.data = g_fus_op_buf;
		if ( m_image.data != nullptr )
		{
			if ( m_image.state != VALIDATE )
			{
				m_image.state_prev = IDLE;
				m_image.state = VALIDATE;
				m_image.sub_state = VALIDATE_READ_HEADER;
			}
		#ifdef OVERRIDE_FUS_TIME
			m_image.wait_time = m_set_validate_time;
		#else
			m_image.wait_time = VALIDATE_WAIT_TIME_MS;
		#endif	// OVERRIDE_FUS_TIME
			m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
			validate_resp->op_time = m_image.wait_time;
			m_image.status = FUS_PENDING_CALL_BACK;
			validate_resp->status = FUS_VALIDATION_IN_PROGRESS;
			m_image.start_time = BF_Lib::Timers::Get_Time();
		}
	}
	return ( m_image.status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
fus_op_status_t Esp32_Image_Ctrl::Commit( image_commit_resp_t* commit_resp )
{
	m_image.status = FUS_PENDING_CALL_BACK;
	NV_Ctrl::mem_range_info_t trusted_mem_range_info = { };
	NV_Ctrl::mem_range_info_t untrusted_mem_range_info = { };

