etn-electrical/JIVE_Client_Code/Babelfish/Code/MiscCode/FUS/Images_Ctrls/Esp32_Image_Ctrl.cpp
	m_image.data = g_fus_op_buf;
	m_image.trusted_nv_ctrl->Get_Memory_Info( &trusted_mem_range_info );
	m_image.untrusted_nv_ctrl->Get_Memory_Info( &untrusted_mem_range_info );

	if ( m_image.data != nullptr )
	{
	#ifdef OVERRIDE_FUS_TIME
		if ( m_set_commit_time != 0U )
		{
			m_image.wait_time = m_set_commit_time;
		}
		else
		{
			m_image.wait_time =
				m_image.untrusted_nv_ctrl->Read_Time( m_image.data, 0,
													  ( untrusted_mem_range_info.end_address -
														untrusted_mem_range_info.start_address ) );
			m_image.wait_time +=
				m_image.trusted_nv_ctrl->Write_Time( NULL, trusted_mem_range_info.start_address,
													 ( trusted_mem_range_info.end_address -
													   trusted_mem_range_info.start_address ), false );
			m_image.wait_time +=
				m_image.trusted_nv_ctrl->Erase_Time( trusted_mem_range_info.start_address,
													 ( trusted_mem_range_info.end_address -
													   trusted_mem_range_info.start_address ) );
		}
	#else
		m_image.wait_time =
			m_image.untrusted_nv_ctrl->Read_Time( m_image.data, 0,
												  ( untrusted_mem_range_info.end_address -
													untrusted_mem_range_info.start_address ) );
		m_image.wait_time +=
			m_image.trusted_nv_ctrl->Write_Time( NULL, trusted_mem_range_info.start_address,
												 ( trusted_mem_range_info.end_address -
												   trusted_mem_range_info.start_address ), false );
		m_image.wait_time +=
			m_image.trusted_nv_ctrl->Erase_Time( trusted_mem_range_info.start_address,
												 ( trusted_mem_range_info.end_address -
												   trusted_mem_range_info.start_address ) );
	#endif	// OVERRIDE_FUS_TIME
		m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
		commit_resp->op_time = m_image.wait_time;
		m_image.state_prev = IDLE;
		m_image.state = COMMIT;
		m_image.sub_state = COMMIT_ERASE_REAL_NV;
		m_image.start_time = BF_Lib::Timers::Get_Time();
	}
	else
	{
		FUS_DEBUG_PRINT( DBG_MSG_ERROR, " In Commit URI - Heap memory not available " );
		// ToDo: Heap not available
		BF_ASSERT( false );
	}
	return ( m_image.status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
fus_op_status_t Esp32_Image_Ctrl::Exit_FUM( void )
{
	m_image.status = FUS_NO_ERROR;
	m_image.untrusted_nv_ctrl = m_image.trusted_nv_ctrl;
	m_image.state = RESET;
	m_commit_ctrl->Reset();
	return ( m_image.status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Commit_Handler( void )
{
	if ( m_image.status != FUS_COMMIT_DONE )
	{
		m_commit_ctrl->Image_Handler( &m_image );
		if ( m_image.status == FUS_PREVIOUS_CMD_ERROR )
		{
			m_image.state_prev = ERROR;
		}
	}
	else
	{
		Update_Version();
		m_image.state = RESET;
		FUS_DEBUG_PRINT( DBG_MSG_INFO, "New Firmware Updated " );
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Validate_Handler( void )
{
	switch ( m_image.sub_state )
	{
		case COMMON_IDLE:
			break;

		case VALIDATE_READ_HEADER:
			Validate_Read_Header_Handler();
			break;

		case VALIDATE_EXTRACT_HEADER:
			Validate_Extract_Header_Handler();
			break;

		case VALIDATE_READ_DATA:
			Validate_Read_Data_Handler();
			break;

		case CALCULATE_CRC_DATA:
			Validate_CRC_Calculation_Handler();
			break;

		case VALIDATE_CRC_DATA:
			Validate_CRC_Data_Handler();
			break;

		case VALIDATE_CODE_SIGNING:
			Validate_Code_Signing_Handler();
			break;

		case VALIDATE_PROD_INFO:
			Validate_Product_Info_Handler();
			break;

		default:
			break;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Validate_Read_Header_Handler( void )
{
	NV_Ctrl::mem_range_info_t untrusted_mem_range_info = { };

	m_image.untrusted_nv_ctrl->Get_Memory_Info( &untrusted_mem_range_info );

	NV_Ctrl::nv_status_t status = m_image.untrusted_nv_ctrl->Read( ( const_cast<uint8_t*>( m_image.data ) ),
																   untrusted_mem_range_info.start_address + m_esp_header_size,
																   sizeof( real_fw_header_s ),
																   Esp32_Image_Ctrl::Image_Status_Cb_Static, this );

	if ( NV_Ctrl::PENDING_CALL_BACK == status )
	{
		m_image.wait_time = m_image.untrusted_nv_ctrl->Read_Time( m_image.data, 0, sizeof( real_fw_header_s ) );
		m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
		m_image.state_prev = VALIDATE;
		m_image.state = WAIT;		/* We will be in WAIT state for infinite time ToDo */
		m_image.sub_state = VALIDATE_READ_HEADER;
		m_image.status = FUS_PENDING_CALL_BACK;
		m_image.start_time = BF_Lib::Timers::Get_Time();
	}
	else if ( NV_Ctrl::BUSY_ERROR == status )
	{
		/* Scratch NV is not available, Somebody might be acquired it. Let's wait  */
		m_image.wait_time = BUSY_ERROR_WAIT_TIME_MS;
		m_image.retry_timeout = RETRY_TIME_MS + BF_Lib::Timers::Get_Time();
		m_image.state_prev = VALIDATE;
		m_image.state = RETRY;	// Alert: Update m_retry_timeout before going into RETRY state
		m_image.sub_state = VALIDATE_READ_HEADER;
		m_image.retry_count++;
	}
	else
	{
		// ToDo
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */

void Esp32_Image_Ctrl::Validate_Extract_Header_Handler( void )
{

	NV_Ctrl::mem_range_info_t untrusted_mem_range_info = { };

	m_new_prod_code = 0U;
	uint32_t version = 0U;
	uint32_t firm_rev = 0U;

	m_image.untrusted_nv_ctrl->Get_Memory_Info( &untrusted_mem_range_info );
	m_image.address = untrusted_mem_range_info.start_address + m_esp_header_size;
	const img_fw_version_t* new_firm_rev;

	/* Extract firmware length from header */
	m_init_crc = 0U;
	real_fw_header* header = reinterpret_cast<real_fw_header*>( m_image.data );

