etn-electrical/JIVE_Client_Code/Babelfish/Code/MiscCode/FUS/Images_Ctrls/Esp32_Image_Ctrl.cpp
	uint32_t untrusted_mem_range =
		( ( untrusted_mem_range_info.end_address - untrusted_mem_range_info.start_address ) + 1 );

	if ( ( header == reinterpret_cast<const real_fw_header*>( NULL ) ) ||
		 ( header == reinterpret_cast<const real_fw_header*>( 0xffffffff ) ) ||
		 ( header->f.magic_endian != MAGIC_ENDIAN ) ||
		 ( header->f.data_length > untrusted_mem_range ) ||
		 ( header->f.image_guid != m_image_config->guid ) )
	{
		FUS_DEBUG_PRINT( DBG_MSG_ERROR, " Firmware Length/ Firmware ID/ Endiancing mismatch " );
		m_image.status = FUS_INVALID_IMAGE_CHECKSUM_FAILED;
		m_image.state_prev = VALIDATE;
		m_image.state = RESET;
		m_image.sub_state = COMMON_IDLE;
	}
	else
	{
		m_image.fw_length = header->f.data_length - m_esp_header_size - ( sizeof ( header->fw_crc ) );
		m_image.address += sizeof ( header->fw_crc );
		m_new_prod_code = *( ( uint16_t* )header->f.product_code );
		new_firm_rev = reinterpret_cast<const img_fw_version_t*>( header->f.version_info );
		Image_Header::Update_Compatibility_Num( header->f.compatibility_num );
		m_image.fw_crc = header->fw_crc.crc;
		version = ( new_firm_rev->build << 16 ) & 0xFFFF0000;
		firm_rev = ( new_firm_rev->minor << 8 ) & 0x0000FF00;
		version = version | ( firm_rev );
		version = version | ( new_firm_rev->major & 0x00FF );
		m_new_image_ver = version;
		m_image.state_prev = VALIDATE;
		m_image.state = VALIDATE;
		/*
		   In ESP32, We are not using the CRC value for validation, That's why instead of moving to VALIDATE_READ_DATA.
		   We are directly moving to code singing validation ( VALIDATE_CODE_SIGNING ).
		   For Image Verification ESP32 is using checksum and HASH value which will already taken care in ESP32
		      bootlaoder.
		   Issue we are facing for CRC validation:- After appending the CRC value in"*.bin" file, ESP32 bootloader
		   checksum and HASH verificaiton becoming invalid. Due to this ESP is not able to find proper bootable
		      partition.
		 */
		if ( LOCAL_COMP_APP_IMG_GUID == m_image_config->guid )
		{
			m_image.sub_state = VALIDATE_CODE_SIGNING;
		}
		else
		{
			m_image.sub_state = VALIDATE_READ_DATA;
		}
        //Ahmed
		FUS_DEBUG_PRINT( DBG_MSG_INFO, "Firmware_version :  %x.%x.%x ", new_firm_rev->major, new_firm_rev->minor,
						 new_firm_rev->build );
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Validate_Read_Data_Handler( void )
{
	uint32_t read_time = 0U;

	if ( m_image.fw_length > MAX_CHUNK_SIZE )
	{
		m_image.length = MAX_CHUNK_SIZE;
	}
	else
	{
		m_image.length = m_image.fw_length;
	}

	NV_Ctrl::nv_status_t status = m_image.untrusted_nv_ctrl->Read( ( const_cast<uint8_t*>( m_image.data ) ),
																   m_image.address, m_image.length,
																   Esp32_Image_Ctrl::Image_Status_Cb_Static, this );

	if ( NV_Ctrl::PENDING_CALL_BACK == status )
	{
		read_time = m_image.untrusted_nv_ctrl->Read_Time( m_image.data, 0, m_image.length );
		m_image.wait_time = ( ( m_image.fw_length / MAX_CHUNK_SIZE ) * read_time );
		m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
		m_image.state_prev = VALIDATE;
		m_image.state = WAIT;
		m_image.sub_state = VALIDATE_READ_DATA;
		m_image.status = FUS_PENDING_CALL_BACK;
		m_image.start_time = BF_Lib::Timers::Get_Time();
	}
	else if ( NV_Ctrl::BUSY_ERROR == status )
	{
		/* Scratch NV is not available, Somebody might be acquired it. Let's wait  */
		m_image.wait_time = BUSY_ERROR_WAIT_TIME_MS;
		m_image.retry_timeout = RETRY_TIME_MS + BF_Lib::Timers::Get_Time();
		m_image.state_prev = VALIDATE;
		m_image.state = RETRY;
		m_image.sub_state = VALIDATE_READ_DATA;
		m_image.retry_count++;
	}
	else
	{
		// ToDo
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Validate_CRC_Calculation_Handler()
{
	uint16_t calc_crc = 0U;

	if ( m_image.fw_length == 0U )
	{
		m_image.state_prev = VALIDATE;
		m_image.state = VALIDATE;
		m_image.sub_state = VALIDATE_CRC_DATA;
		m_image.status = FUS_PENDING_CALL_BACK;
	}
	else
	{
		calc_crc = BF_Lib::CRC16::Calc_On_String( ( const_cast<uint8_t*>( m_image.data ) ), m_image.length,
												  m_init_crc );
		m_init_crc = calc_crc;
		m_image.fw_length -= m_image.length;
		if ( m_image.fw_length != 0U )
		{
			m_image.address += m_image.length;
			m_image.state_prev = VALIDATE;
			m_image.state = VALIDATE;
			m_image.sub_state = VALIDATE_READ_DATA;
		}
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */

void Esp32_Image_Ctrl::Validate_CRC_Data_Handler( void )
{
	NV_Ctrl::mem_range_info_t untrusted_mem_range_info = { };

	m_image.untrusted_nv_ctrl->Get_Memory_Info( &untrusted_mem_range_info );

	if ( m_image.fw_crc == m_init_crc )
	{
		if ( m_image.untrusted_nv_ctrl == m_image.trusted_nv_ctrl )
		{
			m_image.state_prev = VALIDATE;
			m_image.state = RESET;
			m_image.sub_state = COMMON_IDLE;
			m_image.status = FUS_VALID_IMAGE;
		}
		else
		{
			m_image.state_prev = IDLE;
			m_image.state = VALIDATE;
			m_image.sub_state = VALIDATE_CODE_SIGNING;
			m_image.status = FUS_PENDING_CALL_BACK;
		}
	}
	else
	{
		m_image.state_prev = VALIDATE;
		m_image.state = RESET;
		m_image.sub_state = COMMON_IDLE;
		m_image.status = FUS_INVALID_IMAGE_CHECKSUM_FAILED;
		FUS_DEBUG_PRINT( DBG_MSG_ERROR, " Firmware checksum failed " );
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Validate_Code_Signing_Handler( void )
{
	bool sign_status = false;
	PKI_Common::pki_status_t code_sign_ret;

	code_sign_ret = Prod_Spec_Code_Sign( m_image.untrusted_nv_ctrl, &sign_status );
	if ( code_sign_ret == PKI_Common::SUCCESS )
	{
		m_image.state_prev = IDLE;
		m_image.state = VALIDATE;
		m_image.sub_state = VALIDATE_PROD_INFO;
		m_image.status = FUS_PENDING_CALL_BACK;
	}
#ifndef DISABLE_PKI_CERT_GEN_SUPPORT
	else if ( code_sign_ret == PKI_Common::PENDING_CALL_BACK )
	{
		// We are in pki_state = PKI_CERT_INIT
		// wait till operation completes.
	}
#endif
	else if ( code_sign_ret != PKI_Common::BUSY_ERROR )
	{
		m_image.state_prev = VALIDATE;
		m_image.state = RESET;
		m_image.sub_state = COMMON_IDLE;
		m_image.status = FUS_INVALID_IMAGE_SIGNATURE_FAILED;
		FUS_DEBUG_PRINT( DBG_MSG_ERROR, " Firmware signature failed " );
	}
	else
	{
		// Verification is in-progress
	}
}

