etn-electrical/JIVE_Client_Code/Babelfish/Code/MiscCode/FUS/Images_Ctrls/Esp32_Image_Ctrl.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Validate_Product_Info_Handler( void )
{
	if ( PRODUCT_CODE == m_new_prod_code )
	{
		m_image.status = FUS_VALID_IMAGE;
		if ( false == Check_Rollback_Enabled() )
		{
			if ( false == Check_Version() )
			{
				m_image.status = FUS_INVALID_IMAGE_VERSION_ROLLBACK_FAILED;
				FUS_DEBUG_PRINT( DBG_MSG_ERROR, " Firmware version roll back failed " );
			}
		}
	}
	else
	{
		m_image.status = FUS_INVALID_IMAGE_PRODUCT_CODE_FAILED;
		FUS_DEBUG_PRINT( DBG_MSG_ERROR, " Firmware product code failed " );
	}

	m_image.state_prev = VALIDATE;
	m_image.state = RESET;
	m_image.sub_state = COMMON_IDLE;

}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool Esp32_Image_Ctrl::Check_Rollback_Enabled( void )
{
	uint8_t image_upgrade_mode = m_image_config->upgrade_mode;
	bool status = true;		/// < Rollback allowed by default

	switch ( image_upgrade_mode )
	{

		case RESTRICTED_FW_UPGRADE:
		case NO_FW_UPGRADE:
			// Firmware rollback not allowed
			status = false;
			break;

		case UNRESTRICTED_FW_UPGRADE:
		default:
			break;
	}
	return ( status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool Esp32_Image_Ctrl::Check_Version( void )
{
	bool status = false;
	img_fw_version_t current_image_version;
	img_fw_version_t new_image_version;

	current_image_version.major = ( m_image_config->version ) & 0x000000FF;
	current_image_version.minor = ( ( m_image_config->version ) & 0x0000FF00 ) >> 8;
	current_image_version.build = ( ( m_image_config->version ) & 0xFFFF0000 ) >> 16;

	new_image_version.major = ( m_new_image_ver ) & 0x000000FF;
	new_image_version.minor = ( ( m_new_image_ver ) & 0x0000FF00 ) >> 8;
	new_image_version.build = ( ( m_new_image_ver ) & 0xFFFF0000 ) >> 16;

	if ( current_image_version.major == new_image_version.major )
	{
		if ( current_image_version.minor == new_image_version.minor )
		{
			if ( current_image_version.build <= new_image_version.build )
			{
				status = true;
			}
			else
			{
				// misra
			}
		}
		else if ( current_image_version.minor < new_image_version.minor )
		{
			status = true;
		}
		else
		{
			// misra
		}
	}
	else if ( current_image_version.major < new_image_version.major )
	{
		status = true;
	}
	else
	{
		// misra
	}
	return ( status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Reset_Handler( void )
{
	m_image.state = IDLE;
	m_image.address = 0U;
	m_image.length = 0U;
	if ( m_image.state_prev != WRITE )
	{
		m_is_scratch_erased = false;
	}
	m_image.retry_timeout = 0U;
	m_image.retry_count = 0U;
	m_image.fw_length = 0U;

	m_image.state_prev = IDLE;
	m_image.sub_state = COMMON_IDLE;
	m_init_crc = 0U;
	m_image.wait_time = DEFAULT_IDLE_TIME_MS;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Write_Handler( void )
{
	NV_Ctrl::nv_status_t status = m_image.untrusted_nv_ctrl->Write( ( const_cast<uint8_t*>( m_image.data ) ),
																	m_image.address, m_image.length,
																	Esp32_Image_Ctrl::Image_Status_Cb_Static, this );

	if ( NV_Ctrl::PENDING_CALL_BACK == status )
	{
		m_image.wait_time =
			m_image.untrusted_nv_ctrl->Write_Time( m_image.data, m_image.address, m_image.length, false );
		m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
		m_image.state_prev = WRITE;
		m_image.state = WAIT;	/* Image will be in WAIT state for infinite time ToDo */
		m_image.status = FUS_PENDING_CALL_BACK;
		m_image.start_time = BF_Lib::Timers::Get_Time();
	}
	else if ( NV_Ctrl::BUSY_ERROR == status )
	{
		/* Scratch NV is not available, Somebody might be acquired it. Let's wait  */
		m_image.wait_time = BUSY_ERROR_WAIT_TIME_MS;
		m_image.retry_timeout = RETRY_TIME_MS + BF_Lib::Timers::Get_Time();
		m_image.state_prev = WRITE;
		m_image.state = RETRY;	// Alert: Update m_retry_timeout before going into RETRY state
		m_image.retry_count++;
	}
	else
	{
		// ToDo
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Erase_Handler( void )
{
	NV_Ctrl::mem_range_info_t untrusted_mem_range_info = {0};

	m_image.untrusted_nv_ctrl->Get_Memory_Info( &untrusted_mem_range_info );

	NV_Ctrl::nv_status_t status =
		m_image.untrusted_nv_ctrl->Erase_All( Esp32_Image_Ctrl::Image_Status_Cb_Static, this );

	if ( NV_Ctrl::PENDING_CALL_BACK == status )
	{
		m_image.wait_time =
			m_image.untrusted_nv_ctrl->Erase_Time( untrusted_mem_range_info.start_address,
												   ( untrusted_mem_range_info.end_address -
													 untrusted_mem_range_info.start_address ) );
		m_image.wait_time += m_commit_ctrl->Add_Buffer_Time( m_image.wait_time );
		m_image.state_prev = ERASE;
		m_image.state = WAIT;	/* Image will be in WAIT state for infinite time ToDo */
		m_image.status = FUS_PENDING_CALL_BACK;
		m_image.start_time = BF_Lib::Timers::Get_Time();
	}
	else if ( NV_Ctrl::BUSY_ERROR == status )
	{
		m_image.wait_time = BUSY_ERROR_WAIT_TIME_MS;
		m_image.state_prev = ERASE;
		m_image.state = RETRY;
	}
	else
	{
		// ToDo
	}
}

