etn-electrical/JIVE_Client_Code/Babelfish/Code/MiscCode/FUS/Images_Ctrls/Esp32_Image_Ctrl.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Retry_Handler( void )
{
	uint32_t cur_time = BF_Lib::Timers::Get_Time();

	if ( cur_time > m_image.retry_timeout )
	{
		m_image.retry_count++;
		if ( m_image.retry_count > MAX_RETRY_COUNT )
		{
			m_image.state = ERROR;
			m_image.retry_count = 0U;
			/* Enough retry, Now stop */
		}
		else
		{
			m_image.state = m_image.state_prev;
		}
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Error_Handler( void )
{
	m_image.status = FUS_PREVIOUS_CMD_ERROR;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Image_Status_Cb( NV_Ctrl::nv_status_t status )
{
	switch ( status )
	{
		case NV_Ctrl::SUCCESS:
			m_image.status = FUS_NO_ERROR;
			if ( m_image.state_prev == ERASE )
			{
				m_is_scratch_erased = true;
				m_image.state = WRITE;
				m_image.status = FUS_NO_ERROR;
			}
			else if ( m_image.state_prev == WRITE )
			{
				m_image.state = RESET;
			}
			else if ( ( m_image.state_prev == VALIDATE ) && ( m_image.sub_state == VALIDATE_READ_HEADER ) )
			{
				m_image.state_prev = VALIDATE;
				m_image.state = VALIDATE;
				m_image.sub_state = VALIDATE_EXTRACT_HEADER;
			}
			else if ( ( m_image.state_prev == VALIDATE ) && ( m_image.sub_state == VALIDATE_READ_DATA ) )
			{
				m_image.state_prev = VALIDATE;
				m_image.state = VALIDATE;
				m_image.sub_state = CALCULATE_CRC_DATA;
			}
			break;

		case NV_Ctrl::DATA_ERROR:
			m_image.status = FUS_PREVIOUS_CMD_ERROR;
			m_image.state_prev = ERROR;
			m_image.state = RESET;
			break;

		// case NV_Ctrl::BUSY_ERROR:
		// case NV_Ctrl::WRITE_PROTECTED:
		// case NV_Ctrl::INVALID_ADDRESS:
		// case NV_Ctrl::OPERATION_NOT_SUPPORTED:
		// case NV_Ctrl::PENDING_CALL_BACK:
		// break;
		default:
			break;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
fus_op_status_t Esp32_Image_Ctrl::Check_Range( uint32_t address, uint32_t length,
											   const NV_Ctrl::mem_range_info_t* mem_range_ref )
{
	/* Length should not exceed MAX_CHUNK_LENGTH
	   Range should not exceed reference memory*/
	fus_op_status_t status = FUS_NO_ERROR;

	if ( ( address < mem_range_ref->start_address ) ||
		 ( address > ( mem_range_ref->end_address + CODE_SIGN_INFO_MAX_SIZE ) ) )
	{
		status = FUS_BAD_ADDRESS_ERROR;
	}
	else if ( ( ( address + length ) > ( mem_range_ref->end_address + 1U + CODE_SIGN_INFO_MAX_SIZE ) ) ||
			  ( length > MAX_CHUNK_SIZE ) )
	{
		status = FUS_BAD_DATA_LENGTH_ERROR;
	}
	else
	{
		// misra
	}
	return ( status );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Update_Version( void )
{
	if ( m_new_image_ver != m_image_config->version )
	{
		m_image_config->version = m_new_image_ver;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Image_Upgrade_Task( CR_Tasker* cr_task )
{
	switch ( m_image.state )
	{
		case IDLE:
			break;

		case ERASE:
			Erase_Handler();
			break;

		case WRITE:
			Write_Handler();
			break;

		case VALIDATE:
			Validate_Handler();
			break;

		case COMMIT:
			Commit_Handler();
			break;

		case ERROR:
			Error_Handler();
			break;

		case RETRY:
			Retry_Handler();
			break;

		case WAIT:
			Wait_Handler();
			break;

		case RESET:
			Reset_Handler();
			break;

		default:
			break;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool Esp32_Image_Ctrl::New_Request( uint32_t address, uint8_t length )
{
	// return( address > m_image.address ) ;
	// Todo: Implementation pending. This functiomn will check that
	// we should receive fresh and increamental address request
	return ( 1 );
}

#ifdef OVERRIDE_FUS_TIME
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Set_Validate_Time( uint32_t time_msec )
{
	if ( time_msec != 0U )
	{
		m_set_validate_time = time_msec;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Esp32_Image_Ctrl::Set_Commit_Time( uint32_t time_msec )
{
	if ( time_msec != 0U )
	{
		m_set_commit_time = time_msec;
	}
}

#endif	// OVERRIDE_FUS_TIME

}
